export type Question = {
    question: string;
    choices: string[];
    answer: string;
};

export function shuffle(array: Question[]): Question[] {
    for (let i = array.length - 1; i > 0; i--) {
        const j = Math.floor(Math.random() * (i + 1));
        [array[i], array[j]] = [array[j], array[i]];
    }
    return array;
}

export const questionList = [
    {
        "question": "กรุงเทพฯ เป็นเมืองหลวงของประเทศใด?",
        "choices": ["ประเทศไทย", "ลาว", "กัมพูชา", "เมียนมา"],
        "answer": "ประเทศไทย"
    },
    {
        "question": "ผลไม้ชนิดใดเป็นสัญลักษณ์ของประเทศไทย?",
        "choices": ["มะม่วง", "มังคุด", "ทุเรียน", "มะพร้าว"],
        "answer": "ทุเรียน"
    },
    {
        "question": "แม่น้ำใดไหลผ่านกรุงเทพฯ?",
        "choices": ["แม่น้ำโขง", "แม่น้ำเจ้าพระยา", "แม่น้ำชี", "แม่น้ำปิง"],
        "answer": "แม่น้ำเจ้าพระยา"
    },
    {
        "question": "ศาลพระภูมิมีจุดประสงค์เพื่ออะไร?",
        "choices": ["ประดับบ้าน", "บูชาเทพ", "เป็นที่พิงพัก", "ให้ความร่มเย็น"],
        "answer": "บูชาเทพ"
    },
    {
        "question": "สถานที่ใดเป็นแหล่งท่องเที่ยวที่สำคัญในเชียงใหม่?",
        "choices": ["พระบรมมหาราชวัง", "ภูเก็ต", "วัดพระธาตุดอยสุเทพ", "เกาะสมุย"],
        "answer": "วัดพระธาตุดอยสุเทพ"
    },
    {
        "question": "ประเพณีสงกรานต์จัดขึ้นในเดือนใด?",
        "choices": ["มกราคม", "เมษายน", "กรกฎาคม", "ตุลาคม"],
        "answer": "เมษายน"
    },
    {
        "question": "เมืองใดที่มีชื่อเสียงในเรื่องตลาดน้ำ?",
        "choices": ["พัทยา", "เชียงราย", "อัมพวา", "หัวหิน"],
        "answer": "อัมพวา"
    },
    {
        "question": "อาหารไทยชนิดใดมีชื่อเสียงไปทั่วโลก?",
        "choices": ["ข้าวมันไก่", "ผัดไทย", "แกงเขียวหวาน", "ข้าวผัด"],
        "answer": "ผัดไทย"
    },
    {
        "question": "จังหวัดใดเป็นที่ตั้งของอุทยานแห่งชาติแก่งกระจาน?",
        "choices": ["ประจวบคีรีขันธ์", "เพชรบุรี", "ระนอง", "ชุมพร"],
        "answer": "เพชรบุรี"
    },
    {
        "question": "สะพานแห่งใดในไทยที่มีชื่อเสียงด้านประวัติศาสตร์สงครามโลกครั้งที่ 2?",
        "choices": ["สะพานพระราม 8", "สะพานภูมิพล", "สะพานข้ามแม่น้ำแคว", "สะพานสารสิน"],
        "answer": "สะพานข้ามแม่น้ำแคว"
    },
    {
        "question": "ชื่อเต็มของกรุงเทพฯ มีคำกี่คำ?",
        "choices": ["5 คำ", "10 คำ", "15 คำ", "20 คำ"],
        "answer": "20 คำ"
    },
    {
        "question": "สถานที่ท่องเที่ยวแห่งใดอยู่ในภาคเหนือของไทย?",
        "choices": ["พัทยา", "ภูเก็ต", "เชียงใหม่", "หัวหิน"],
        "answer": "เชียงใหม่"
    },
    {
        "question": "ขนมไทยชนิดใดทำจากกะทิและน้ำตาลมะพร้าว?",
        "choices": ["ขนมครก", "ขนมชั้น", "ขนมเปียกปูน", "ข้าวเหนียวมะม่วง"],
        "answer": "ขนมครก"
    },
    {
        "question": "ในประเทศไทยมีการขับรถฝั่งใด?",
        "choices": ["ซ้าย", "ขวา", "กลาง", "ไม่กำหนด"],
        "answer": "ซ้าย"
    },
    {
        "question": "เครื่องดนตรีชนิดใดเป็นเอกลักษณ์ของภาคอีสาน?",
        "choices": ["ซอ", "แคน", "กลอง", "ระนาด"],
        "answer": "แคน"
    },
    {
        "question": "จังหวัดใดเป็นที่ตั้งของตลาดน้ำดำเนินสะดวก?",
        "choices": ["สมุทรสาคร", "ราชบุรี", "นครปฐม", "สุพรรณบุรี"],
        "answer": "ราชบุรี"
    },
    {
        "question": "ปูชนียบุคคลใดเป็นที่นับถือของคนไทยในฐานะ 'พ่อของแผ่นดิน'?",
        "choices": ["พระบาทสมเด็จพระเจ้าอยู่หัวภูมิพลอดุลยเดช", "พระนเรศวร", "พระเจ้าตากสิน", "พระพุทธยอดฟ้าจุฬาโลก"],
        "answer": "พระบาทสมเด็จพระเจ้าอยู่หัวภูมิพลอดุลยเดช"
    },
    {
        "question": "วัดพระศรีรัตนศาสดารามมีชื่อเล่นว่าอะไร?",
        "choices": ["วัดพระแก้ว", "วัดโพธิ์", "วัดอรุณ", "วัดสุทัศน์"],
        "answer": "วัดพระแก้ว"
    },
    {
        "question": "การแสดงโขนมีจุดเด่นที่ใด?",
        "choices": ["การร้องเพลง", "การเต้นระบำ", "การเล่าเรื่องรามเกียรติ์", "การใช้เครื่องดนตรี"],
        "answer": "การเล่าเรื่องรามเกียรติ์"
    },
    {
        "question": "เกาะใดเป็นแหล่งท่องเที่ยวที่มีชื่อเสียงในอ่าวไทย?",
        "choices": ["เกาะพีพี", "เกาะสมุย", "เกาะตาชัย", "เกาะหลีเป๊ะ"],
        "answer": "เกาะสมุย"
    }
]